---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialColor.Clone
source: html/576b3c40-f2bd-9c0d-dab9-08cf00eb1643.htm
---
# Autodesk.Revit.DB.Lighting.InitialColor.Clone Method

Creates a copy of the InitialColor derived object.

## Syntax (C#)
```csharp
public InitialColor Clone()
```